# IMemberForcesServer Interface (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IMemberForcesServer Interface
Members See Also
---
Interface for the Member Forces server to implement.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public interface IMemberForcesServer : IExternalServer
```

Visual Basic
---
```text
Public Interface IMemberForcesServer _
	Inherits IExternalServer
```

Visual C++
---
```text
public interface class IMemberForcesServer : IExternalServer
```

# See Also
IMemberForcesServer Members
Autodesk.Revit.DB.Structure Namespace